workstation/openfoam-master-tutorials/tutorials/lagrangian/kinematicParcelFoam/pitzDailyWithSprinklers/system/faSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Uf_film
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
    }

    hf_film
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
    }
}

PIMPLE
{
    momentumPredictor true;
    nOuterCorr        2;
    nCorr             2;
    nFilmCorr         1;
}

relaxationFactors
{
    hf_Film    1;
    Uf_Film    1;
}


// ************************************************************************* //
